<a href="https://colab.research.google.com/github/connectkishan1/Pandas-Practice/blob/master/useful_pattern_while_extract_split_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [171]:
import numpy as np
import pandas as pd
import re

### Series.str.extract(pattern, string, flags=0))

- \w matches alphanumeric characters
- \d matches digits, which means 0-9
- \s matches whitespace characters
- \S matches non-whitespace characters
- . matches any character except the new line character \n
- *matches 0 or more instances of a pattern

In [229]:
dict = {'movie_data':['The Godfather 1972 9.2', 
                    'Bird Box 2018 6.8', 
                    'Fight Club 1999 8.8'] } 
  
# Convert the dictionary to a dataframe 
df = pd.DataFrame(dict) 
  
# Extract name from the string  
df['Name'] = df['movie_data'].str.extract('(\w*\s\w*)', expand=True) 
   
# Extract year from the string  
df['Year'] = df['movie_data'].str.extract('(\d\d\d\d)', expand=True) 
  
# Extract rating from the string  
df['Rating'] = df['movie_data'].str.extract('(\d\.\d)', expand=True) 
print(df)

               movie_data           Name  Year Rating
0  The Godfather 1972 9.2  The Godfather  1972    9.2
1       Bird Box 2018 6.8       Bird Box  2018    6.8
2     Fight Club 1999 8.8     Fight Club  1999    8.8

In [221]:
a=[["Mr-kishan#kumar@kumar10$dec+1992"],["kishan#kumar"]]#list

In [222]:
b=np.array(a)#converted to array
b

array([['Mr-kishan#kumar@kumar10$dec+1992'],
       ['kishan#kumar']], dtype='<U32')

In [230]:
df1=pd.DataFrame(b)#converted to Dataframe 
df1

                                  0
0  Mr-kishan#kumar@kumar10$dec+1992
1                      kishan#kumar

In [231]:
df1[0].str.extract('([a-zA-Z0-9]+)',expand=True)

        0
0      Mr
1  kishan

In [232]:
df1[0].str.split('([a-zA-Z0-9]+)',expand=True)

  0       1  2       3  4      5     6        7     8     9    10    11    12
0        Mr  -  kishan  #  kumar     @  kumar10     $   dec     +  1992
1    kishan  #   kumar      None  None     None  None  None  None  None  None

In [215]:
c="Mr-kishan#kumar@kumar10$dec+1992"#list

In [216]:
print(re.split('\d+', c))

['Mr-kishan#kumar@kumar', '$dec+', '']

In [218]:
d=re.split('[-+#@$]', c)#
d

['Mr', 'kishan', 'kumar', 'kumar10', 'dec', '1992']

### [a-zA-Z0-9]+ 
its a pattern that matches against a string of any length, as long as the string contains only lowercase letters ( a-z ), uppercase letters ( A-Z ), or numerals ( 0-9 )

In [220]:
d2=re.split('([a-zA-Z0-9]+)',c)
d2

['',
 'Mr',
 '-',
 'kishan',
 '#',
 'kumar',
 '@',
 'kumar10',
 '$',
 'dec',
 '+',
 '1992',
 '']